#!/usr/bin/env python3
# -*- coding: utf-8 -*-
"""
Объявите функцию, которая вычисляет периметр многоугольника и возвращает
вычисленное значение. Длины сторон многоугольника передаются в виде коллекции (списка
или кортежа). Определите декоратор для этой функции, который выводит на экран
сообщение: «Периметр фигуры равен = <число>». Примените декоратор к функции и
вызовите декорированную функцию.
"""


def decorator(func):
    def wrapper(*args):
        print('Периметр многоугольника равен = {:.1f}'.format(func(args)))

    return wrapper


@decorator
def polygon(*args):
    s = sum(list(*args))
    return s


if __name__ == "__main__":
    polygon(11, 12, 13, 14, 15)
